In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = sns.load_dataset('tips')

In [3]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [6]:
df['total_bill'].sum()

np.float64(4827.77)

In [7]:
type(df['total_bill'].sum())

numpy.float64

In [8]:
df.isnull()

     total_bill    tip    sex  smoker    day   time   size
0         False  False  False   False  False  False  False
1         False  False  False   False  False  False  False
2         False  False  False   False  False  False  False
3         False  False  False   False  False  False  False
4         False  False  False   False  False  False  False
..          ...    ...    ...     ...    ...    ...    ...
239       False  False  False   False  False  False  False
240       False  False  False   False  False  False  False
241       False  False  False   False  False  False  False
242       False  False  False   False  False  False  False
243       False  False  False   False  False  False  False

[244 rows x 7 columns]

In [9]:
df.isnull().count()

total_bill    244
tip           244
sex           244
smoker        244
day           244
time          244
size          244
dtype: int64

In [10]:
df.isnull().sum()

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

#### Aggrigation Function

In [11]:
df['tip'].mean()

np.float64(2.99827868852459)

In [13]:
round(df['tip'].mean())

3

 #### Count , Min, Max ,Sum , Average ,Standard varience

In [14]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [15]:
df['time']

0      Dinner
1      Dinner
2      Dinner
3      Dinner
4      Dinner
        ...
239    Dinner
240    Dinner
241    Dinner
242    Dinner
243    Dinner
Name: time, Length: 244, dtype: category
Categories (2, object): ['Lunch', 'Dinner']

In [16]:
df['time'].unique()

['Dinner', 'Lunch']
Categories (2, object): ['Lunch', 'Dinner']

In [17]:
df.groupby(['time']).sum(['total_bill'])

C:\Users\Hp\AppData\Local\Temp\ipykernel_3312\1808404741.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby(['time']).sum(['total_bill'])

        total_bill     tip  size
time
Lunch      1167.47  185.51   164
Dinner     3660.30  546.07   463

In [20]:
df.groupby(['time'], observed=True)['total_bill'].sum()

time
Lunch     1167.47
Dinner    3660.30
Name: total_bill, dtype: float64

In [21]:
gender = df.groupby('sex', observed=True)

In [22]:
gender

In [25]:
gender.count()

        total_bill  tip  smoker  day  time  size
sex
Male           157  157     157  157   157   157
Female          87   87      87   87    87    87

In [23]:
gender.sum(['total_bill'])

        total_bill     tip  size
sex
Male       3256.82  485.07   413
Female     1570.95  246.51   214

In [30]:
gender['total_bill'].sum()

sex
Male      3256.82
Female    1570.95
Name: total_bill, dtype: float64

In [32]:
gender['total_bill'].count()

sex
Male      157
Female     87
Name: total_bill, dtype: int64

In [33]:
gender['total_bill'].sum() / gender['total_bill'].count()

sex
Male      20.744076
Female    18.056897
Name: total_bill, dtype: float64

#### Multi category grouping

In [34]:
gt = df.groupby(['sex','time'], observed=True)

In [35]:
gt

In [36]:
gt['total_bill'].sum()

sex     time
Male    Lunch      595.60
        Dinner    2661.22
Female  Lunch      571.87
        Dinner     999.08
Name: total_bill, dtype: float64

In [37]:
gt.sum(['total_bill'])

               total_bill     tip  size
sex    time
Male   Lunch       595.60   95.11    78
       Dinner     2661.22  389.96   335
Female Lunch       571.87   90.40    86
       Dinner      999.08  156.11   128

In [38]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [39]:
df.size

1708

In [40]:
df.shape

(244, 7)

In [52]:
df.groupby(['day','time'])

C:\Users\Hp\AppData\Local\Temp\ipykernel_3312\3211548855.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby(['day','time'])

In [53]:
dt = df.groupby(['day','time'], observed=False)

In [54]:
dt.sum('total_bill')

             total_bill     tip  size
day  time
Thur Lunch      1077.55  168.83   150
     Dinner       18.78    3.00     2
Fri  Lunch        89.92   16.68    14
     Dinner      235.96   35.28    26
Sat  Lunch         0.00    0.00     0
     Dinner     1778.40  260.40   219
Sun  Lunch         0.00    0.00     0
     Dinner     1627.16  247.39   216